# Token telegram bot
bot_token = '1209932930:AAEAJKgG_rjIiiMYV7XoAGknUxUwhvwMY7o' # токен бота
CHANNEL_ID = 1215398916 # id канала куда будет отсылаться информация, ид без -100 в начале (например: 124873248) - указать заместо нуля

# ID admin
admin_id = 1378953559 # id админа - указать заместо нуля

bot_login = 'EGEbasher_bot' # логин бота
ref_percent = 10 # Процент реферальной системы

QIWI_NUMBER = '+79674860772'    # номер киви
QIWI_TOKEN = 'b75d575638586a013fc870e2c187bcfd'            # токен киви

text_purchase = '❕ Вы выбрали: ' \
                '{name}\n\n' \
                '{info}\n\n' \
                '💠 Цена: {price} рублей\n' \
                '💠 Кол-во товара: {amount}' \


# инфа
info = '''❗️ Информация:\n'''

# Пополнение баланса
replenish_balance = '⚠️ Пополнение баланса\n\n' \
                    '🥝 Оплата киви: \n\n' \
                    '👉 Ссылка https://qiwi.com/n/VINCI209 \n\n' \
                    '👉 Коментарий  {code}\n' \
                    '👉 Сумма  от 1 до 15000 рублей'

# Профиль
profile = '🧾 Профиль\n\n' \
          '❕ Ваш id - {id}\n' \
          '❕ Ваш логин - {login}\n' \
          '❕ Дата регистрации - {data}\n\n' \
          '💰 Ваш баланс - {balance} рублей'
